alexvatti/embedded-documents/SoC-Validation/firmware/gpu_validation/gpu/gp/m400_gp_F094_RSQ_mem_0.c
/* ###################
 * START OF NEW MEMPAGE: 0 */
/* input0_select 16                                                                 */
/* mul0 0 0                                                                         */
/* lut_op 4                                                                         */
/* mult_op 3                                                                        */
/* lut_input 0                                                                      */
/* input0_select 16                                                                 */
/* mul0 22 18                                                                       */
/* mul1 22 0                                                                        */
/* mult_op 1                                                                        */
/* out_xy_comp 16                                                                   */
/* out_x_select 5                                                                   */
/*  load multiple registers (0-63) from address 0x40                                */
/*  load constant registers (0-3) from address 0x300                                */
/*  load shader from address 0x400                                                  */
/*  set number of output registers                                                  */
/*  Start shader (1 vertex)                                                         */
/* unsigned int data_00000000[1024] = */ 
{
  0x00000040, 0x20400000, 0x00000300, 0x30040000 /* 0x0; */
, 0x00000400, 0x400a0000, 0x0f000033, 0x10000042 /* 0x10; */
, 0x00200800, 0x10000040, 0x40000001, 0x00000000 /* 0x20; */
, 0x00000000, 0x60000000, 0x00000000, 0x00000000 /* 0x30; */
, 0x00004000, 0x00002000, 0x00000210, 0x0000203f /* 0x40; */
, 0x00000220, 0x0000203f, 0x00000230, 0x0000203f /* 0x50; */
, 0x00000240, 0x0000203f, 0x00000250, 0x0000203f /* 0x60; */
, 0x00000260, 0x0000203f, 0x00000270, 0x0000203f /* 0x70; */
, 0x00000280, 0x0000203f, 0x00000290, 0x0000203f /* 0x80; */
, 0x000002a0, 0x0000203f, 0x000002b0, 0x0000203f /* 0x90; */
, 0x000002c0, 0x0000203f, 0x000002d0, 0x0000203f /* 0xa0; */
, 0x000002e0, 0x0000203f, 0x000002f0, 0x0000203f /* 0xb0; */
, 0x00002000, 0x00002000, 0x00002010, 0x0000203f /* 0xc0; */
, 0x00002020, 0x0000203f, 0x00002030, 0x0000203f /* 0xd0; */
, 0x00002040, 0x0000203f, 0x00002050, 0x0000203f /* 0xe0; */
, 0x00002060, 0x0000203f, 0x00002070, 0x0000203f /* 0xf0; */
, 0x00002080, 0x0000203f, 0x00002090, 0x0000203f /* 0x100; */
, 0x000020a0, 0x0000203f, 0x000020b0, 0x0000203f /* 0x110; */
, 0x000020c0, 0x0000203f, 0x000020d0, 0x0000203f /* 0x120; */
, 0x000020e0, 0x0000203f, 0x000020f0, 0x0000203f /* 0x130; */
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x3f2a6400, 0xbf317600, 0x3e8d8e00, 0x00000000 /* 0x300; */
, 0x3f2f7000, 0x3f36e200, 0x3e10c500, 0x00000000 /* 0x310; */
, 0xbe974e00, 0x3dc35300, 0x3f735800, 0x00000000 /* 0x320; */
, 0x00000000, 0x00000000, 0x00000000, 0x3f800000 /* 0x330; */
, 0x42b00000, 0x42dc0000, 0x3f800000, 0x3f800000 /* 0x340; */
, 0x42b00000, 0x42dc0000, 0x00000000, 0x00000000 /* 0x350; */
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0xad4ad400, 0x438002b5, 0x0107ffe0, 0x00000030 /* 0x400; */
, 0xad405a56, 0x438002b5, 0x0007ffe0, 0x00001c10 /* 0x410; */
, 0xad4ad6b5, 0x038002b5, 0x4007fee0, 0x00001c00 /* 0x420; */
},

/* ###################
 * START OF NEW MEMPAGE: 2 */
/* EMPTY PAGE */ 
/* unsigned int data_00002000[1024]; */ 
{0},

/* ###################
 * START OF NEW MEMPAGE: 4 */
/* unsigned int data_00004000[1024] = */ 
{
  0x3f840000, 0x3f880000, 0x3f8c0000, 0x3f900000 /* 0x4000; */
, 0x3f940000, 0x3f980000, 0x3f9c0000, 0x3fa00000 /* 0x4010; */
, 0x3fa40000, 0x3fa80000, 0x3fac0000, 0x3fb00000 /* 0x4020; */
, 0x3fb40000, 0x3fb80000, 0x3fbc0000, 0x3fc00000 /* 0x4030; */
, 0x3fc40000, 0x3fc80000, 0x3fcc0000, 0x3fd00000 /* 0x4040; */
, 0x3fd40000, 0x3fd80000, 0x3fdc0000, 0x3fe00000 /* 0x4050; */
, 0x3fe40000, 0x3fe80000, 0x3fec0000, 0x3ff00000 /* 0x4060; */
, 0x3ff40000, 0x3ff80000, 0x3ffc0000, 0x40000000 /* 0x4070; */
, 0x40040000, 0x40080000, 0x400c0000, 0x40100000 /* 0x4080; */
, 0x40140000, 0x40180000, 0x401c0000, 0x40200000 /* 0x4090; */
, 0x40240000, 0x40280000, 0x402c0000, 0x40300000 /* 0x40a0; */
, 0x40340000, 0x40380000, 0x403c0000, 0x40400000 /* 0x40b0; */
, 0x40440000, 0x40480000, 0x404c0000, 0x40500000 /* 0x40c0; */
, 0x40540000, 0x40580000, 0x405c0000, 0x40600000 /* 0x40d0; */
, 0x40640000, 0x40680000, 0x406c0000, 0x40700000 /* 0x40e0; */
, 0x40740000, 0x40780000, 0x407c0000, 0x40800000 /* 0x40f0; */
},

};
